Ran Plan for dir: `terraform/kubernetes` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # proxmox_virtual_environment_file.cp_config will be created
+ resource "proxmox_virtual_environment_file" "cp_config" {
      + content_type           = "snippets"
      + datastore_id           = "backup-nas"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "prox2"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = <<-EOT
                #cloud-config
                write_files:
                runcmd:
                  - hostnamectl set-hostname $(cat /dev/urandom | tr -dc 'a-z0-9' | fold -w 8 | head -n 1)-cp-worker
                  - curl -sfL https://get.k3s.io | K3S_URL=https://cp.home.bryanwp.com:6443 K3S_TOKEN=mynodetoken sh -
            EOT
          + file_name = "k3s-cp.cloud-config.yaml"
          + resize    = 0
        }
    }

  # proxmox_virtual_environment_vm.kube_cp[0] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "kube_cp" {
      ~ id                      = "500" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "32:E9:98:68:8C:07",
        ] -> (known after apply)
        name                    = "cp-polaris-0"
      ~ network_interface_names = [] -> (known after apply)
      ~ tags                    = [
          - "cp",
          - "k8s",
            "terraform",
          + "k8s",
          + "cp",
        ]
        # (21 unchanged attributes hidden)

      ~ disk {
          ~ path_in_datastore = "vm-500-disk-0" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ initialization {
          - interface         = "ide2" -> null
          + user_data_file_id = (known after apply) # forces replacement
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          ~ mac_address = "32:E9:98:68:8C:07" -> (known after apply)
            # (8 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.kube_cp[1] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "kube_cp" {
      ~ id                      = "501" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "AA:63:A9:82:38:37",
        ] -> (known after apply)
        name                    = "cp-polaris-1"
      ~ network_interface_names = [] -> (known after apply)
      ~ tags                    = [
          - "cp",
          - "k8s",
            "terraform",
          + "k8s",
          + "cp",
        ]
        # (21 unchanged attributes hidden)

      ~ disk {
          ~ path_in_datastore = "vm-501-disk-0" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ initialization {
          - interface         = "ide2" -> null
          + user_data_file_id = (known after apply) # forces replacement
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          ~ mac_address = "AA:63:A9:82:38:37" -> (known after apply)
            # (8 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.kube_cp[2] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "kube_cp" {
      ~ id                      = "502" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "B2:5E:1C:1F:9B:6D",
        ] -> (known after apply)
        name                    = "cp-polaris-2"
      ~ network_interface_names = [] -> (known after apply)
      ~ tags                    = [
          - "cp",
          - "k8s",
            "terraform",
          + "k8s",
          + "cp",
        ]
        # (21 unchanged attributes hidden)

      ~ disk {
          ~ path_in_datastore = "vm-502-disk-0" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ initialization {
          - interface         = "ide2" -> null
          + user_data_file_id = (known after apply) # forces replacement
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          ~ mac_address = "B2:5E:1C:1F:9B:6D" -> (known after apply)
            # (8 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

Plan: 4 to add, 0 to change, 3 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/kubernetes`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b498d417ac9c:4141/lock?id=resnostyle%252Fk8s-gitops%252Fterraform%252Fkubernetes%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/kubernetes`
</details>
Plan: 4 to add, 0 to change, 3 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`